In [113]:
import numpy as np
import pandas as pd

df = pd.DataFrame(
    {'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
    'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
    'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
    'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
    '12. Air France', '"Swiss Air"']})

In [114]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [115]:
# Part 1)
min_flight_num = int(df['FlightNumber'].min())
max_flight_num = int(df['FlightNumber'].max())

df['FlightNumber'].fillna(-1,inplace=True)
for i,num in zip(range(len(df)),range(min_flight_num,max_flight_num+1,10)):
  if df.loc[i,'FlightNumber'] == -1:
    df.loc[i,'FlightNumber'] = num

df['FlightNumber'] = df['FlightNumber'].astype(int)

In [116]:
#Parts 2 and 4
df['From'] = [word.split('_')[0] for word in df['From_To']]
df['To'] = [word.split('_')[1] for word in df['From_To']]
df.drop('From_To',1,inplace=True)

In [117]:
# Part 3
df['From'] = df['From'].apply(lambda x : x.lower().capitalize())
df['To'] = df['To'].apply(lambda x : x.lower().capitalize())

In [118]:
# Part 5
delays = df[['RecentDelays']]
max_delay_len = max([len(delay) for delay in df['RecentDelays']])
print("max_delay_len : ",max_delay_len)

delay_arr = np.zeros((len(df),max_delay_len))

for row,delay_list in enumerate(delays['RecentDelays']):
  for col,value in enumerate(delay_list):
    delay_arr[row,col] = value

del delays
delay_column_name = [('delay_'+ str(i)) for i in range(1,max_delay_len+1)]
delays = pd.DataFrame(data = delay_arr,columns = delay_column_name)
delays.replace(0,np.nan,inplace=True)

df = pd.concat([df,delays],axis=1)
df.drop('RecentDelays',1,inplace=True)

max_delay_len :  3

In [119]:
df

   FlightNumber              Airline      From  ... delay_1  delay_2  delay_3
0         10045               KLM(!)    London  ...    23.0     47.0      NaN
1         10055    <Air France> (12)    Madrid  ...     NaN      NaN      NaN
2         10065  (British Airways. )    London  ...    24.0     43.0     87.0
3         10075       12. Air France  Budapest  ...    13.0      NaN      NaN
4         10085          "Swiss Air"  Brussels  ...    67.0     32.0      NaN

[5 rows x 7 columns]

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [96]:
delays

   delay_1  delay_2  delay_3
0     23.0     47.0      0.0
1      0.0      0.0      0.0
2     24.0     43.0     87.0
3     13.0      0.0      0.0
4     67.0     32.0      0.0